[ ASW 1 – ServerFarm ]

#2-1.  기본 설정
Switch>enable
Switch#configure terminal 
#Global Configuration 모드로 진입합니다.
Switch(config)#hostname ASW1
#장비명을 변경합니다.
ASW1(config)#enable secret cisco123
#유저 모드에서 관리자 모드로 진입할 때 사용할 패스워드를 설정합니다. 
#secret 옵션을 사용하여 패스워드를 암호화합니다.
ASW1(config)#username admin secret cisco123
#admin이라는 유저를 생성하고 비밀번호는 cisco123로 설정합니다
ASW1(config)#no ip domain lookup
#도메인 lookup 기능을 비활성화 합니다.

 #2-2.  콘솔 환경 설정
ASW1(config)#line console 0
#콘솔이 연결되는 0번째 포트로 들어갑니다
ASW1(config-line)#logging synchronous
#터미널 창에서 로그 메시지와 명령창을 분리합니다.
ASW1(config-line)#exec-timeout 10 0
#세션 타임 아웃 시간을 10분으로 설정합니다. 
ASW1(config-line)#password cisco123
#콘솔로 접속할 때 사용할 패스워드를 설정해줍니다
ASW1(config-line)#login local
#login을 활성화 합니다, 보안을 위해 유저 네임도 입력받습니다
ASW1(config-line)#exit

ASW1(config)#line vty 0 1
#원격 연결할 수 있는 포트를 생성합니다
ASW1(config-line)#logging synchronous
#터미널 창에서 로그 메시지와 명령창을 분리합니다.
ASW1(config-line)#exec-timeout 05 0
#세션 타임 아웃 시간을 5분으로 설정합니다. 
ASW1(config-line)#password cisco123
#원격으로 접속할 때 사용할 패스워드를 설정해줍니다
ASW1(config-line)#login local
#login을 활성화 합니다.
ASW1(config-line)#exit

ASW1(config)#interface range ethernet 0/0-3, e 1/0-3, e 2/0-3, e 3/0-3
#interface 진입 명령어에 range 옵션을 사용하여 한번에 다수의 인터페이스에 진입합니다.
ASW1(config-if-range)#shutdown
#보안을 위해 모든 포트를 다운시킵니다.

ASW1(config-if-range)#exit

#2-3.  VLAN 생성 및 Access Port 설정
# [VLAN 생성]
ASW1(config)#vlan 10
#VLAN 10번을 생성합니다.
ASW1(config-vlan)#name DB/Storage
#VLAN 이름을 ServerFarm으로 설정합니다.
ASW1(config-vlan)#exit

ASW1(config)#vlan 15
#VLAN 15번을 생성합니다.
ASW1(config-vlan)#name Was
#VLAN 이름을 ServerFarm으로 설정합니다.
ASW1(config-vlan)#exit

# [VLAN Access Link]
● #ASW1_DB
ASW1(config)#interface range ethernet 0/0-3
#ethernet 0/0~3 통합 인터페이스에 진입합니다.
ASW1(config-if)#description ##ASW1_DB/Storage##
#해당 연결에 대한 주석을 달아줍니다.
ASW1(config-if)#switchport mode access
#access mode로 전환합니다.
ASW1(config-if)#switchport access vlan 10
#VLAN10 에 대한 access port 로 지정합니다.
ASW1(config-if)#spanning-tree portfast
#처음 스위치 연결 시 루프가 돌 수 있는 환경을 검사하는 리스닝, 러닝하는 30초의 시간을 없애고 
#바로 포워딩 상태로 동작 할 수 있게 하게 설정합니다
ASW1(config-if)#no shutdown
#포트를 활성화 합니다
ASW1(config-if)#exit

● #ASW1_WAS
ASW1(config)#interface range ethernet 1/0-1
#ethernet 1/0~1/1 통합 인터페이스에 진입합니다.
ASW1(config-if)#description ##ASW1_WAS##
#해당 연결에 대한 주석을 달아줍니다.
ASW1(config-if)#switchport mode access
#access mode로 전환합니다.
ASW1(config-if)#switchport access vlan 15
# VLAN15 에 대한 access port 로 지정합니다.
ASW1(config-if)#spanning-tree portfast
처음 스위치 연결 시 루프가 돌 수 있는 환경을 검사하는 리스닝, 러닝하는 30초의 시간을 없애고 
바로 포워딩 상태로 동작 할 수 있게 하게 설정합니다
ASW1(config-if)#no shutdown
포트를 활성화 합니다
ASW1(config-if)#exit


● #ASW1_Storage
ASW1(config)#interface range ethernet 2/0-2
#ethernet 2/0~2/1 통합 인터페이스에 진입합니다.
ASW1(config-if)#description ##ASW1_WAS##
#해당 연결에 대한 주석을 달아줍니다.
ASW1(config-if)#switchport mode access
#access mode로 전환합니다.
ASW1(config-if)#switchport access vlan 15
# VLAN15 에 대한 access port 로 지정합니다.
ASW1(config-if)#spanning-tree portfast
처음 스위치 연결 시 루프가 돌 수 있는 환경을 검사하는 리스닝, 러닝하는 30초의 시간을 없애고 
바로 포워딩 상태로 동작 할 수 있게 하게 설정합니다
ASW1(config-if)#no shutdown
포트를 활성화 합니다
ASW1(config-if)#exit


# 2-4.  Trunk Prot 설정 및 Port Channel 구성 (Active)
● # ASW1_DSW1
ASW1(config)#interface range ethernet 3/0-1
#ethernet 3/0~3/1 통합 인터페이스에 진입합니다.
ASW1(config-if-range)#description ##ASW1_Trunk_Port##
#해당 연결에 대한 주석을 달아줍니다.
ASW1(config-if-range)#switchport trunk encapsulation dot1q
# trunk 프로토콜은 cisco전용 ISL과 표준인 dot1q가 있습니다. 표준인 dot1q로 설정합니다
ASW1(config-if-range)#switchport trunk allowed vlan 10,vlan 15,vlan 250
# 트렁크 포트로 작동할 때 DMZ의 특성상 VLAN 10,15,250만 통과 가능하도록 설정합니다
ASW1(config-if-range)#switchport trunk native vlan 999
native vlan을 999로 변경하여 보안성 강화합니다. (기본값 1)
ASW1(config-if-range)#switchport mode trunk
포트를 trunk 모드로 전환합니다.
ASW1(config-if-range)#switchport nonegotiate
협상 모드를 비활성화 합니다.
ASW1(config-if-range)#channel-group 1 mode active
이더 채널 1로 구성하여 active 모드(적극적 협상 모드)로 설정합니다.
ASW1(config-if-range)#no shutdown
포트를 활성화 합니다
ASW1(config-if-range)#exit

● # ASW1_DSW2
ASW1(config)#interface range e3/2-3
#ethernet 3/0~3/1 통합 인터페이스에 진입합니다.
ASW1(config-if-range)#description ##ASW1_Trunk_Port##
#해당 연결에 대한 주석을 달아줍니다.
ASW1(config-if-range)#switchport trunk encapsulation dot1q
# trunk 프로토콜은 cisco전용 ISL과 표준인 dot1q가 있습니다. 표준인 dot1q로 설정합니다
ASW1(config-if-range)#switchport trunk allowed vlan 10,vlan 15,vlan 250
# 트렁크 포트로 작동할 때 DMZ의 특성상 VLAN 10,15,250만 통과 가능하도록 설정합니다
ASW1(config-if-range)#switchport trunk native vlan 999
native vlan을 999로 변경하여 보안성 강화합니다. (기본값 1)
ASW1(config-if-range)#switchport mode trunk
포트를 trunk 모드로 전환합니다.
ASW1(config-if-range)#switchport nonegotiate
협상 모드를 비활성화 합니다.
ASW1(config-if-range)#channel-group 2 mode active
이더 채널 2로 구성하여 active 모드(적극적 협상 모드)로 설정합니다.
ASW1(config-if-range)#no shutdown
포트를 활성화 합니다
ASW1(config-if-range)#exit